/*===========================================================================================
概　略：プレイシーンを扱う処理
作成日：2015年/5月/27日
更新日：
制作者：佐々木　郁哉
=============================================================================================*/

//---------------インクルード-----------------------
#include "PlayScene.h"
#include "Player.h"
#include "Enemy.h"

//――――――――――――――――――――――
//	コンストラクタ
//――――――――――――――――――――――
PlayScene::PlayScene()
{
	//ユニットを追加
	unit.push_back(new Player);

	//敵５体を追加
	for (int i = 0; i < 5; i++)
	{
		unit.push_back(new Enemy);
	}
}
